;~ =============================================================================
;~ Rizonesoft Language File
;~ =============================================================================
;~ Date.........: 15 March 2025
;~ Author.......: Derick Payne (Rizonesoft)
;~ Link.........: https://rizonesoft.com
;~ =============================================================================

[Main]
Product = Firemin
Version = 12

[Language]
;~ Please ad the translated language name next to the English name. For example; Ελληνικά - Greek
Name = Português - Portuguese
Code = pt
Encoding = Unicode (UTF-16) LE BOM

[Translations]
;~ Please do not translate this section.
About = About
Custom = Custom
Donate = Donate
Menus = Menus
Messages = Messages
Messages2 = Messages2
Preferences = Preferences
Update = Update
Versioning = Versioning

[About]
Window_Title = Sobre o %{Program.Name}
Label_Version = Versão
Label_AutoIt = Criado com a versão AutoIt
Label_Copyright = Direitos de autor
Tip_Title_Donate = Apoie o nosso trabalho
Tip_Message_Donate = A sua doação ajudará a manter o nosso software gratuito\r\ne permitirá que obtenhamos as ferramentas e serviços\r\nque usamos para o servir.
Label_Home = Página inicial
Label_License = Licença
Label_Support = Obter suporte
Tip_Title_Country = Feito na África do Sul
Tip_Message_Country = %{Program.Name} foi criado na República da África do Sul.
Label_Contributors = Colaboradores
Button_Ok = OK
Label_RAM = (RAM) %d MB livre de %d MB (%d%%)
Label_HDD = (%s) %.2f GB livre de %.2f GB (%d%%)
Tip_Facebook = Siga-nos no Facebook.
Tip_GitHub = %{Program.Name} no GitHub.

[Custom]
Label_Status_Welcome = Comece por carregar um navegador (selecione o ficheiro).\r\n%{Program.Name} detetará automaticamente o processo do executável selecionado.
Label_Status_Updates = A verificar atualizações
Group_Load_Browser = Carregar navegador
Label_Executable = Caminho do executável (%s):
Label_Process_Usage = Utilização | Pico:
Label_Process_Count = Contagem de processos:
Button_Browse = &Procurar
Group_Options = Opções
Checkbox_Reduce_Mem = Reduzir memória a cada:
Label_Milliseconds = milissegundos
Checkbox_Reduce_Limit = Reduzir memória quando a utilização exceder:
Checkbox_Start_With = Iniciar %s com o %{Program.Name}
Checkbox_Enable_Extended_Processes = Ativar processos estendidos
Button_Extended_Processes = Processos &estendidos
Checkbox_Start_Windows = Iniciar %{Program.Name} com o Windows
Label_Settings_Updated = Definições atualizadas com sucesso.
Button_Cancel = Cancelar
Button_Save = Guardar
Time_Unit_01 = milissegundos
Time_Unit_02 = segundos
Time_Unit_03 = minutos
Time_Unit_04 = horas
Label_Boost_Description = Reduzir a cada %s %s quando a utilização exceder %s MB.
Title_Select_Browser = Selecionar navegador
Tip_Minimized_Title = %{Program.Name} ainda está em execução!
Tip_Minimized_Message = %{Program.Name} continuará a otimizar a utilização de memória do %s.\r\nClique no ícone da bandeja do sistema para modificar várias opções de otimização.
Label_Notice = %{Program.Name} foi projetado para uso em computadores de secretária e portáteis.\r\nPara ambientes de servidor, criámos o Firemin Server. Saiba mais...

[Donate]
Label_Heading = Que tal uma pequena doação para manter o nosso software gratuito para sempre?
Label_Message = Clique no botão PayPal abaixo, escolha um valor e envie a sua doação.\r\nA sua doação ajudará a melhorar o nosso software e manter tudo gratuito no Rizonesoft.\r\nUma doação de 20$ permitirá que operemos durante pelo menos um mês.
Label_Donate = Consideraria fazer uma doação de 10$ para nos ajudar a melhorar o %{Program.Name} e continuar a nossa missão?

[Menus]
File = &Ficheiro
File_Preferences = &Preferências
File_Close = &Sair\tShift+Alt+F4
Help = A&juda
Help_Update = &Verificar atualizações
Help_Home = Página inicial do %{Company.Name} (&H)
Help_Downloads = Mais &transferências
Help_Support = Obter &suporte
Help_Issue = Reportar um &problema
Help_Donate = Apoie o nosso &trabalho
Help_About = Sobre o %{Program.Name}
Tray_About = Sobre o %{Program.Name} %s
Tray_Open = Abrir %{Program.Name}
Tray_Extended_Processes = Processos estendidos
Tray_Run = Executar %s
Tray_Run_Safemode = Executar %s em modo seguro

[Messages]
Info_Title = Por favor, note
Warning_Title = Aviso!
Error_Title = Ups! Algo correu mal!
Error_Oops = Ups!
Singleton = Outra instância do %{Program.Name} já está em execução.\r\nDica: Clique no ícone do %{Program.Name} na bandeja do sistema.
Compatible = O %{Program.Name} não é compatível com a sua versão do Windows.\r\nSe acha que isto é um erro, não hesite em deixar uma mensagem em '%s' com todos os detalhes.
Compatible_Bit = Lamentamos, mas a versão de 32 bits do %{Program.Name} não é compatível com a sua versão do Windows.\r\nPor favor, transfira a versão de 64 bits do %{Program.Name} de '%s'.

[Preferences]
Window_Title = Preferências
Tab_General = Geral
Tab_Performance = Desempenho
Tab_Language = Idioma
Group_Notifications = Notificações
Group_Extended_Processes = Processos estendidos
Group_Priority = Prioridade
Group_Memory = Memória
Group_Language = Idioma
Checkbox_Notifications = Mostrar notificações na bandeja do sistema
Label_Extended_Processes = Introduza aqui os nomes de quaisquer processos adicionais que deseja que o %{Program.Name} otimize.\r\nA lista deve ser separada por vírgulas (Process01.exe, Process02.exe, etc.)
Label_SetPriority = Definir prioridade do processo:
Checkbox_SaveRealtime = Guardar prioridade acima de alta (não recomendado).
Checkbox_ReduceMemory = Reduzir memória em sistemas com pouca memória.
Label_Language_Message = Selecione o seu idioma preferido e pressione o botão %s para continuar. (Requer reinício)
Button_Save = Guardar
Button_Cancel = Cancelar
Label_Updated = Preferências atualizadas
MsgBox_Language_Title = Idioma alterado
MsgBox_Language_Message = O idioma selecionado foi alterado.\r\nO %{Program.Name} precisa ser reiniciado para aplicar o idioma selecionado.
MsgBox_Closing_Title = A fechar o %{Program.Name}
MsgBox_Closing_Message = Deseja fechar o %{Program.Name} agora?

[Update]
Window_Title_Available = Atualização disponível
Window_Title_Congratulations = Parabéns!
Window_Title_Error = Algo correu mal!
Label_Message_Update = Está disponível uma nova versão do '%{Program.Name}'.
Label_Message_Latest = Está a utilizar a versão mais recente do '%{Program.Name}'.
Label_Message_Error = Não foi possível obter informações sobre a versão mais recente do '%{Program.Name}'.
Label_Message_Internet = Verifique a sua ligação à Internet e tente novamente.
Label_Build_Current = Versão atual:
Label_Build_Update = Versão da atualização:
CheckBox_NoUpdate = Não verificar atualizações ao iniciar.
Button_Update = Saber mais
Button_Close = Fechar

[Versioning]
Administrator = Administrador
Build = Versão
AutoIt_Version = Utiliza AutoIt versão %{AutoIt.Version}
Bit = bits